hpmicro/hpm_sdk/soc/HPM5E00/ip/hpm_pwmv2_regs.h
/* Bitfield definition for register: FORCE_MODE */
/*
 * POLARITY (RW)
 *
 * one bit for one pwm channel, it's used as shadow register when pwm_cfg0.polarity_opt0 is set.
 * output polarity, set to 1 will invert the output
 */
#define PWMV2_FORCE_MODE_POLARITY_MASK (0xFF0000UL)
#define PWMV2_FORCE_MODE_POLARITY_SHIFT (16U)
#define PWMV2_FORCE_MODE_POLARITY_SET(x) (((uint32_t)(x) << PWMV2_FORCE_MODE_POLARITY_SHIFT) & PWMV2_FORCE_MODE_POLARITY_MASK)
#define PWMV2_FORCE_MODE_POLARITY_GET(x) (((uint32_t)(x) & PWMV2_FORCE_MODE_POLARITY_MASK) >> PWMV2_FORCE_MODE_POLARITY_SHIFT)

/*
 * FORCE_MODE (RW)
 *
 * 2bit for each PWM channel(0~7);
 * 00:  force output 0
 * 01:  force output 1
 * 10:  output highz(pad_oe_*=0)
 * 11:  no force
 * this field may be changed by software as shadow register , the update time should be defined by chan_cfg.load, only for PWM channels.
 */
#define PWMV2_FORCE_MODE_FORCE_MODE_MASK (0xFFFFU)
#define PWMV2_FORCE_MODE_FORCE_MODE_SHIFT (0U)
#define PWMV2_FORCE_MODE_FORCE_MODE_SET(x) (((uint32_t)(x) << PWMV2_FORCE_MODE_FORCE_MODE_SHIFT) & PWMV2_FORCE_MODE_FORCE_MODE_MASK)
#define PWMV2_FORCE_MODE_FORCE_MODE_GET(x) (((uint32_t)(x) & PWMV2_FORCE_MODE_FORCE_MODE_MASK) >> PWMV2_FORCE_MODE_FORCE_MODE_SHIFT)

/* Bitfield definition for register: WORK_CTRL1 */
/*
 * SHADOW_LOCK (RW)
 *
 * one to lock,  sofware can't write any shadow registers
 * Software have to write 0x…. to work_ctrl0 to clear this bit.
 */
#define PWMV2_WORK_CTRL1_SHADOW_LOCK_MASK (0x80000000UL)
#define PWMV2_WORK_CTRL1_SHADOW_LOCK_SHIFT (31U)
#define PWMV2_WORK_CTRL1_SHADOW_LOCK_SET(x) (((uint32_t)(x) << PWMV2_WORK_CTRL1_SHADOW_LOCK_SHIFT) & PWMV2_WORK_CTRL1_SHADOW_LOCK_MASK)
#define PWMV2_WORK_CTRL1_SHADOW_LOCK_GET(x) (((uint32_t)(x) & PWMV2_WORK_CTRL1_SHADOW_LOCK_MASK) >> PWMV2_WORK_CTRL1_SHADOW_LOCK_SHIFT)

/* Bitfield definition for register of struct array PWM: CFG0 */
/*
 * TRIG_SEL4 (RW)
 *
 * for N=0/2/4/6, clear to select 2 compare point(N*2~N*2+1);
 * set to select 4 compare point(N*2~N*2+3);
 * or use 2 compare point(N*2+2~N*2+3);
 * for N=1/3/5/7, this bit is no means, it can work on pair mode, or use 2 compare point (N*2+2~N*2+3);
 * assume select ab or abcd,  abcd can between 0 and 2T.
 * output will be 1 when counter value between a and b;
 * if b<=a then output all 0; if b>=(T+a), then output all 1;
 */
#define PWMV2_PWM_CFG0_TRIG_SEL4_MASK (0x1000000UL)
#define PWMV2_PWM_CFG0_TRIG_SEL4_SHIFT (24U)
#define PWMV2_PWM_CFG0_TRIG_SEL4_SET(x) (((uint32_t)(x) << PWMV2_PWM_CFG0_TRIG_SEL4_SHIFT) & PWMV2_PWM_CFG0_TRIG_SEL4_MASK)
#define PWMV2_PWM_CFG0_TRIG_SEL4_GET(x) (((uint32_t)(x) & PWMV2_PWM_CFG0_TRIG_SEL4_MASK) >> PWMV2_PWM_CFG0_TRIG_SEL4_SHIFT)

/*
 * FAULT_SEL_ASYNC (RW)
 *
 * select from 16bit async fault from pad
 */
#define PWMV2_PWM_CFG0_FAULT_SEL_ASYNC_MASK (0xF00U)
#define PWMV2_PWM_CFG0_FAULT_SEL_ASYNC_SHIFT (8U)
#define PWMV2_PWM_CFG0_FAULT_SEL_ASYNC_SET(x) (((uint32_t)(x) << PWMV2_PWM_CFG0_FAULT_SEL_ASYNC_SHIFT) & PWMV2_PWM_CFG0_FAULT_SEL_ASYNC_MASK)
#define PWMV2_PWM_CFG0_FAULT_SEL_ASYNC_GET(x) (((uint32_t)(x) & PWMV2_PWM_CFG0_FAULT_SEL_ASYNC_MASK) >> PWMV2_PWM_CFG0_FAULT_SEL_ASYNC_SHIFT)

/*
 * FAULT_POL_ASYNC (RW)
 *
 * fault polarity for input fault from pad, 1-active low;  0-active high;
 */
#define PWMV2_PWM_CFG0_FAULT_POL_ASYNC_MASK (0x40U)
#define PWMV2_PWM_CFG0_FAULT_POL_ASYNC_SHIFT (6U)
#define PWMV2_PWM_CFG0_FAULT_POL_ASYNC_SET(x) (((uint32_t)(x) << PWMV2_PWM_CFG0_FAULT_POL_ASYNC_SHIFT) & PWMV2_PWM_CFG0_FAULT_POL_ASYNC_MASK)
#define PWMV2_PWM_CFG0_FAULT_POL_ASYNC_GET(x) (((uint32_t)(x) & PWMV2_PWM_CFG0_FAULT_POL_ASYNC_MASK) >> PWMV2_PWM_CFG0_FAULT_POL_ASYNC_SHIFT)

/*
 * FAULT_EN_ASYNC (RW)
 *
 * set to enable the input async faults from pad directly
 */
#define PWMV2_PWM_CFG0_FAULT_EN_ASYNC_MASK (0x20U)
#define PWMV2_PWM_CFG0_FAULT_EN_ASYNC_SHIFT (5U)
#define PWMV2_PWM_CFG0_FAULT_EN_ASYNC_SET(x) (((uint32_t)(x) << PWMV2_PWM_CFG0_FAULT_EN_ASYNC_SHIFT) & PWMV2_PWM_CFG0_FAULT_EN_ASYNC_MASK)
#define PWMV2_PWM_CFG0_FAULT_EN_ASYNC_GET(x) (((uint32_t)(x) & PWMV2_PWM_CFG0_FAULT_EN_ASYNC_MASK) >> PWMV2_PWM_CFG0_FAULT_EN_ASYNC_SHIFT)

/*
 * FAULT_EN_SYNC (RW)
 *
 * set to enable the input faults from trig_mux(trigger_in[0] for channel0/1, 1 for 23, 2 for 45, 3 for 67)
 */
#define PWMV2_PWM_CFG0_FAULT_EN_SYNC_MASK (0x10U)
#define PWMV2_PWM_CFG0_FAULT_EN_SYNC_SHIFT (4U)
#define PWMV2_PWM_CFG0_FAULT_EN_SYNC_SET(x) (((uint32_t)(x) << PWMV2_PWM_CFG0_FAULT_EN_SYNC_SHIFT) & PWMV2_PWM_CFG0_FAULT_EN_SYNC_MASK)
#define PWMV2_PWM_CFG0_FAULT_EN_SYNC_GET(x) (((uint32_t)(x) & PWMV2_PWM_CFG0_FAULT_EN_SYNC_MASK) >> PWMV2_PWM_CFG0_FAULT_EN_SYNC_SHIFT)

/*
 * POL_UPDATE_SEL (RW)
 *
 * used when polarity_opt0 is set, define when to update polarity working register.
 * 0:  software set work_ctrl1.shadow_lock bit
 * 1:  update at reload point;
 */
#define PWMV2_PWM_CFG0_POL_UPDATE_SEL_MASK (0x4U)
#define PWMV2_PWM_CFG0_POL_UPDATE_SEL_SHIFT (2U)
#define PWMV2_PWM_CFG0_POL_UPDATE_SEL_SET(x) (((uint32_t)(x) << PWMV2_PWM_CFG0_POL_UPDATE_SEL_SHIFT) & PWMV2_PWM_CFG0_POL_UPDATE_SEL_MASK)
#define PWMV2_PWM_CFG0_POL_UPDATE_SEL_GET(x) (((uint32_t)(x) & PWMV2_PWM_CFG0_POL_UPDATE_SEL_MASK) >> PWMV2_PWM_CFG0_POL_UPDATE_SEL_SHIFT)

/*
 * OUT_POLARITY (RW)
 *
 * output polarity, set to 1 will invert the output.
 * when polarity_opt0 is set, this bit is controlled by shadow register, can't be writable; read as working register
 * use compare channel settings(in cmp_cfg) as shadow register update
 */
#define PWMV2_PWM_CFG0_OUT_POLARITY_MASK (0x2U)
#define PWMV2_PWM_CFG0_OUT_POLARITY_SHIFT (1U)
#define PWMV2_PWM_CFG0_OUT_POLARITY_SET(x) (((uint32_t)(x) << PWMV2_PWM_CFG0_OUT_POLARITY_SHIFT) & PWMV2_PWM_CFG0_OUT_POLARITY_MASK)
#define PWMV2_PWM_CFG0_OUT_POLARITY_GET(x) (((uint32_t)(x) & PWMV2_PWM_CFG0_OUT_POLARITY_MASK) >> PWMV2_PWM_CFG0_OUT_POLARITY_SHIFT)

/*
 * POLARITY_OPT0 (RW)
 *
 * set to use shadow polarity
 */
#define PWMV2_PWM_CFG0_POLARITY_OPT0_MASK (0x1U)
#define PWMV2_PWM_CFG0_POLARITY_OPT0_SHIFT (0U)
#define PWMV2_PWM_CFG0_POLARITY_OPT0_SET(x) (((uint32_t)(x) << PWMV2_PWM_CFG0_POLARITY_OPT0_SHIFT) & PWMV2_PWM_CFG0_POLARITY_OPT0_MASK)
#define PWMV2_PWM_CFG0_POLARITY_OPT0_GET(x) (((uint32_t)(x) & PWMV2_PWM_CFG0_POLARITY_OPT0_MASK) >> PWMV2_PWM_CFG0_POLARITY_OPT0_SHIFT)

