hpmicro/hpm_sdk/soc/HPM5E00/ip/hpm_pwmv2_regs.h
/*
 * CNT_UPDATE_EN0 (RW)
 *
 * set to enable using trig0 to load calculation cell output to counter
 */
#define PWMV2_CNT_CFG2_CNT_UPDATE_EN0_MASK (0x80U)
#define PWMV2_CNT_CFG2_CNT_UPDATE_EN0_SHIFT (7U)
#define PWMV2_CNT_CFG2_CNT_UPDATE_EN0_SET(x) (((uint32_t)(x) << PWMV2_CNT_CFG2_CNT_UPDATE_EN0_SHIFT) & PWMV2_CNT_CFG2_CNT_UPDATE_EN0_MASK)
#define PWMV2_CNT_CFG2_CNT_UPDATE_EN0_GET(x) (((uint32_t)(x) & PWMV2_CNT_CFG2_CNT_UPDATE_EN0_MASK) >> PWMV2_CNT_CFG2_CNT_UPDATE_EN0_SHIFT)

/*
 * CNT_TRIG0 (RW)
 *
 * change counter value to one of the calculation cell output when cnt_update_triger0 issued
 */
#define PWMV2_CNT_CFG2_CNT_TRIG0_MASK (0xFU)
#define PWMV2_CNT_CFG2_CNT_TRIG0_SHIFT (0U)
#define PWMV2_CNT_CFG2_CNT_TRIG0_SET(x) (((uint32_t)(x) << PWMV2_CNT_CFG2_CNT_TRIG0_SHIFT) & PWMV2_CNT_CFG2_CNT_TRIG0_MASK)
#define PWMV2_CNT_CFG2_CNT_TRIG0_GET(x) (((uint32_t)(x) & PWMV2_CNT_CFG2_CNT_TRIG0_MASK) >> PWMV2_CNT_CFG2_CNT_TRIG0_SHIFT)

/* Bitfield definition for register of struct array CNT: CFG3 */
/*
 * CNT_START_SEL (RW)
 *
 * select one trigger from 8, should set to pulse in trig_mux
 */
#define PWMV2_CNT_CFG3_CNT_START_SEL_MASK (0x700000UL)
#define PWMV2_CNT_CFG3_CNT_START_SEL_SHIFT (20U)
#define PWMV2_CNT_CFG3_CNT_START_SEL_SET(x) (((uint32_t)(x) << PWMV2_CNT_CFG3_CNT_START_SEL_SHIFT) & PWMV2_CNT_CFG3_CNT_START_SEL_MASK)
#define PWMV2_CNT_CFG3_CNT_START_SEL_GET(x) (((uint32_t)(x) & PWMV2_CNT_CFG3_CNT_START_SEL_MASK) >> PWMV2_CNT_CFG3_CNT_START_SEL_SHIFT)

/*
 * CNT_HW_START_EN (RW)
 *
 * enable use trigger to start pwm output(at next reload point), by cnt_start_sel
 */
#define PWMV2_CNT_CFG3_CNT_HW_START_EN_MASK (0x20000UL)
#define PWMV2_CNT_CFG3_CNT_HW_START_EN_SHIFT (17U)
#define PWMV2_CNT_CFG3_CNT_HW_START_EN_SET(x) (((uint32_t)(x) << PWMV2_CNT_CFG3_CNT_HW_START_EN_SHIFT) & PWMV2_CNT_CFG3_CNT_HW_START_EN_MASK)
#define PWMV2_CNT_CFG3_CNT_HW_START_EN_GET(x) (((uint32_t)(x) & PWMV2_CNT_CFG3_CNT_HW_START_EN_MASK) >> PWMV2_CNT_CFG3_CNT_HW_START_EN_SHIFT)

/*
 * CNT_BURST (RW)
 *
 * output pwm wave for configured burst(timer period),
 * 0 for one burst;  1 for two burst.
 * set to 0xFFFF for always output pwm wave
 * bit's only used when setting cnt_sw_start or trigger selected by cnt_start_sel
 */
#define PWMV2_CNT_CFG3_CNT_BURST_MASK (0xFFFFU)
#define PWMV2_CNT_CFG3_CNT_BURST_SHIFT (0U)
#define PWMV2_CNT_CFG3_CNT_BURST_SET(x) (((uint32_t)(x) << PWMV2_CNT_CFG3_CNT_BURST_SHIFT) & PWMV2_CNT_CFG3_CNT_BURST_MASK)
#define PWMV2_CNT_CFG3_CNT_BURST_GET(x) (((uint32_t)(x) & PWMV2_CNT_CFG3_CNT_BURST_MASK) >> PWMV2_CNT_CFG3_CNT_BURST_SHIFT)

/* Bitfield definition for register: CNT_GLBCFG */
/*
 * CNT_SW_START (WO)
 *
 * set to start pwm output(at next reload point), write only, Auto clear.
 * User can disable pwm output before burst end by start again with cnt_burst=0
 */
#define PWMV2_CNT_GLBCFG_CNT_SW_START_MASK (0xF0000UL)
#define PWMV2_CNT_GLBCFG_CNT_SW_START_SHIFT (16U)
#define PWMV2_CNT_GLBCFG_CNT_SW_START_SET(x) (((uint32_t)(x) << PWMV2_CNT_GLBCFG_CNT_SW_START_SHIFT) & PWMV2_CNT_GLBCFG_CNT_SW_START_MASK)
#define PWMV2_CNT_GLBCFG_CNT_SW_START_GET(x) (((uint32_t)(x) & PWMV2_CNT_GLBCFG_CNT_SW_START_MASK) >> PWMV2_CNT_GLBCFG_CNT_SW_START_SHIFT)

/*
 * TIMER_RESET (WO)
 *
 * set to clear current timer. Auto clear
 */
#define PWMV2_CNT_GLBCFG_TIMER_RESET_MASK (0xF00U)
#define PWMV2_CNT_GLBCFG_TIMER_RESET_SHIFT (8U)
#define PWMV2_CNT_GLBCFG_TIMER_RESET_SET(x) (((uint32_t)(x) << PWMV2_CNT_GLBCFG_TIMER_RESET_SHIFT) & PWMV2_CNT_GLBCFG_TIMER_RESET_MASK)
#define PWMV2_CNT_GLBCFG_TIMER_RESET_GET(x) (((uint32_t)(x) & PWMV2_CNT_GLBCFG_TIMER_RESET_MASK) >> PWMV2_CNT_GLBCFG_TIMER_RESET_SHIFT)

/*
 * TIMER_ENABLE (RW)
 *
 * 1 to enable the main cycle counter; 0 to stop the counter;
 * NOTE:  when counter stopped, the related trigger_out will be cleared to 0, the related pwm output will keep value not changed.
 */
#define PWMV2_CNT_GLBCFG_TIMER_ENABLE_MASK (0xFU)
#define PWMV2_CNT_GLBCFG_TIMER_ENABLE_SHIFT (0U)
#define PWMV2_CNT_GLBCFG_TIMER_ENABLE_SET(x) (((uint32_t)(x) << PWMV2_CNT_GLBCFG_TIMER_ENABLE_SHIFT) & PWMV2_CNT_GLBCFG_TIMER_ENABLE_MASK)
#define PWMV2_CNT_GLBCFG_TIMER_ENABLE_GET(x) (((uint32_t)(x) & PWMV2_CNT_GLBCFG_TIMER_ENABLE_MASK) >> PWMV2_CNT_GLBCFG_TIMER_ENABLE_SHIFT)

/* Bitfield definition for register of struct array CAL: CFG0 */
/*
 * CAL_LU_PARAM (RW)
 *
 * up limit parameter
 */
#define PWMV2_CAL_CFG0_CAL_LU_PARAM_MASK (0x1F000000UL)
#define PWMV2_CAL_CFG0_CAL_LU_PARAM_SHIFT (24U)
#define PWMV2_CAL_CFG0_CAL_LU_PARAM_SET(x) (((uint32_t)(x) << PWMV2_CAL_CFG0_CAL_LU_PARAM_SHIFT) & PWMV2_CAL_CFG0_CAL_LU_PARAM_MASK)
#define PWMV2_CAL_CFG0_CAL_LU_PARAM_GET(x) (((uint32_t)(x) & PWMV2_CAL_CFG0_CAL_LU_PARAM_MASK) >> PWMV2_CAL_CFG0_CAL_LU_PARAM_SHIFT)

/*
 * CAL_LL_PARAM (RW)
 *
 * low limit parameter
 */
#define PWMV2_CAL_CFG0_CAL_LL_PARAM_MASK (0x1F0000UL)
#define PWMV2_CAL_CFG0_CAL_LL_PARAM_SHIFT (16U)
#define PWMV2_CAL_CFG0_CAL_LL_PARAM_SET(x) (((uint32_t)(x) << PWMV2_CAL_CFG0_CAL_LL_PARAM_SHIFT) & PWMV2_CAL_CFG0_CAL_LL_PARAM_MASK)
#define PWMV2_CAL_CFG0_CAL_LL_PARAM_GET(x) (((uint32_t)(x) & PWMV2_CAL_CFG0_CAL_LL_PARAM_MASK) >> PWMV2_CAL_CFG0_CAL_LL_PARAM_SHIFT)

/*
 * CAL_T_PARAM (RW)
 *
 * period parameter
 */
#define PWMV2_CAL_CFG0_CAL_T_PARAM_MASK (0x1F00U)
#define PWMV2_CAL_CFG0_CAL_T_PARAM_SHIFT (8U)
#define PWMV2_CAL_CFG0_CAL_T_PARAM_SET(x) (((uint32_t)(x) << PWMV2_CAL_CFG0_CAL_T_PARAM_SHIFT) & PWMV2_CAL_CFG0_CAL_T_PARAM_MASK)
#define PWMV2_CAL_CFG0_CAL_T_PARAM_GET(x) (((uint32_t)(x) & PWMV2_CAL_CFG0_CAL_T_PARAM_MASK) >> PWMV2_CAL_CFG0_CAL_T_PARAM_SHIFT)

/*
 * CAL_D_PARAM (RW)
 *
 * dac/counter value parameter
 */
#define PWMV2_CAL_CFG0_CAL_D_PARAM_MASK (0x1FU)
#define PWMV2_CAL_CFG0_CAL_D_PARAM_SHIFT (0U)
#define PWMV2_CAL_CFG0_CAL_D_PARAM_SET(x) (((uint32_t)(x) << PWMV2_CAL_CFG0_CAL_D_PARAM_SHIFT) & PWMV2_CAL_CFG0_CAL_D_PARAM_MASK)
#define PWMV2_CAL_CFG0_CAL_D_PARAM_GET(x) (((uint32_t)(x) & PWMV2_CAL_CFG0_CAL_D_PARAM_MASK) >> PWMV2_CAL_CFG0_CAL_D_PARAM_SHIFT)

/* Bitfield definition for register of struct array CAL: CFG1 */
/*
 * CAL_T_INDEX (RW)
 *
 * select one of 4 counter reload time
 */
#define PWMV2_CAL_CFG1_CAL_T_INDEX_MASK (0x30000000UL)
#define PWMV2_CAL_CFG1_CAL_T_INDEX_SHIFT (28U)
#define PWMV2_CAL_CFG1_CAL_T_INDEX_SET(x) (((uint32_t)(x) << PWMV2_CAL_CFG1_CAL_T_INDEX_SHIFT) & PWMV2_CAL_CFG1_CAL_T_INDEX_MASK)
#define PWMV2_CAL_CFG1_CAL_T_INDEX_GET(x) (((uint32_t)(x) & PWMV2_CAL_CFG1_CAL_T_INDEX_MASK) >> PWMV2_CAL_CFG1_CAL_T_INDEX_SHIFT)

