hpmicro/hpm_sdk/soc/HPM5E00/ip/hpm_pwmv2_regs.h
/*
 * CAL_IN_INDEX (RW)
 *
 * 0~3 to select one of the dac input value; 4~7 to select one of the current counter value
 */
#define PWMV2_CAL_CFG1_CAL_IN_INDEX_MASK (0x7000000UL)
#define PWMV2_CAL_CFG1_CAL_IN_INDEX_SHIFT (24U)
#define PWMV2_CAL_CFG1_CAL_IN_INDEX_SET(x) (((uint32_t)(x) << PWMV2_CAL_CFG1_CAL_IN_INDEX_SHIFT) & PWMV2_CAL_CFG1_CAL_IN_INDEX_MASK)
#define PWMV2_CAL_CFG1_CAL_IN_INDEX_GET(x) (((uint32_t)(x) & PWMV2_CAL_CFG1_CAL_IN_INDEX_MASK) >> PWMV2_CAL_CFG1_CAL_IN_INDEX_SHIFT)

/*
 * CAL_LU_EN (RW)
 *
 * set to enable up limit
 */
#define PWMV2_CAL_CFG1_CAL_LU_EN_MASK (0x800000UL)
#define PWMV2_CAL_CFG1_CAL_LU_EN_SHIFT (23U)
#define PWMV2_CAL_CFG1_CAL_LU_EN_SET(x) (((uint32_t)(x) << PWMV2_CAL_CFG1_CAL_LU_EN_SHIFT) & PWMV2_CAL_CFG1_CAL_LU_EN_MASK)
#define PWMV2_CAL_CFG1_CAL_LU_EN_GET(x) (((uint32_t)(x) & PWMV2_CAL_CFG1_CAL_LU_EN_MASK) >> PWMV2_CAL_CFG1_CAL_LU_EN_SHIFT)

/*
 * CAL_LIM_UP (RW)
 *
 * up limit offset selection, select from one of the shadow_val
 */
#define PWMV2_CAL_CFG1_CAL_LIM_UP_MASK (0x1F0000UL)
#define PWMV2_CAL_CFG1_CAL_LIM_UP_SHIFT (16U)
#define PWMV2_CAL_CFG1_CAL_LIM_UP_SET(x) (((uint32_t)(x) << PWMV2_CAL_CFG1_CAL_LIM_UP_SHIFT) & PWMV2_CAL_CFG1_CAL_LIM_UP_MASK)
#define PWMV2_CAL_CFG1_CAL_LIM_UP_GET(x) (((uint32_t)(x) & PWMV2_CAL_CFG1_CAL_LIM_UP_MASK) >> PWMV2_CAL_CFG1_CAL_LIM_UP_SHIFT)

/*
 * CAL_LL_EN (RW)
 *
 * set to enable low limit
 */
#define PWMV2_CAL_CFG1_CAL_LL_EN_MASK (0x8000U)
#define PWMV2_CAL_CFG1_CAL_LL_EN_SHIFT (15U)
#define PWMV2_CAL_CFG1_CAL_LL_EN_SET(x) (((uint32_t)(x) << PWMV2_CAL_CFG1_CAL_LL_EN_SHIFT) & PWMV2_CAL_CFG1_CAL_LL_EN_MASK)
#define PWMV2_CAL_CFG1_CAL_LL_EN_GET(x) (((uint32_t)(x) & PWMV2_CAL_CFG1_CAL_LL_EN_MASK) >> PWMV2_CAL_CFG1_CAL_LL_EN_SHIFT)

/*
 * CAL_LIM_LO (RW)
 *
 * low limit offset selection, select from one of the shadow_val
 */
#define PWMV2_CAL_CFG1_CAL_LIM_LO_MASK (0x1F00U)
#define PWMV2_CAL_CFG1_CAL_LIM_LO_SHIFT (8U)
#define PWMV2_CAL_CFG1_CAL_LIM_LO_SET(x) (((uint32_t)(x) << PWMV2_CAL_CFG1_CAL_LIM_LO_SHIFT) & PWMV2_CAL_CFG1_CAL_LIM_LO_MASK)
#define PWMV2_CAL_CFG1_CAL_LIM_LO_GET(x) (((uint32_t)(x) & PWMV2_CAL_CFG1_CAL_LIM_LO_MASK) >> PWMV2_CAL_CFG1_CAL_LIM_LO_SHIFT)

/*
 * CAL_IN_OFF (RW)
 *
 * offset for calculation unit, select from one of the shadow_val.
 */
#define PWMV2_CAL_CFG1_CAL_IN_OFF_MASK (0x1FU)
#define PWMV2_CAL_CFG1_CAL_IN_OFF_SHIFT (0U)
#define PWMV2_CAL_CFG1_CAL_IN_OFF_SET(x) (((uint32_t)(x) << PWMV2_CAL_CFG1_CAL_IN_OFF_SHIFT) & PWMV2_CAL_CFG1_CAL_IN_OFF_MASK)
#define PWMV2_CAL_CFG1_CAL_IN_OFF_GET(x) (((uint32_t)(x) & PWMV2_CAL_CFG1_CAL_IN_OFF_MASK) >> PWMV2_CAL_CFG1_CAL_IN_OFF_SHIFT)

/* Bitfield definition for register of struct array CMP: CFG */
/*
 * CMP_TRIG_SEL (RW)
 *
 * select one trigger from 8, should set to pulse in trig_mux
 */
#define PWMV2_CMP_CFG_CMP_TRIG_SEL_MASK (0x70000000UL)
#define PWMV2_CMP_CFG_CMP_TRIG_SEL_SHIFT (28U)
#define PWMV2_CMP_CFG_CMP_TRIG_SEL_SET(x) (((uint32_t)(x) << PWMV2_CMP_CFG_CMP_TRIG_SEL_SHIFT) & PWMV2_CMP_CFG_CMP_TRIG_SEL_MASK)
#define PWMV2_CMP_CFG_CMP_TRIG_SEL_GET(x) (((uint32_t)(x) & PWMV2_CMP_CFG_CMP_TRIG_SEL_MASK) >> PWMV2_CMP_CFG_CMP_TRIG_SEL_SHIFT)

/*
 * CMP_UPDATE_TIME (RW)
 *
 * define when to use the shadow register value for working register(trig_cmp)
 * 000:  software set work_ctrl1.shadow_lock bit
 * 001:  update immediately(at next cycle)
 * 010:  related counter reload time
 * 011:  use cmp_update_trigger(from trig_mux, selected by cmp_trig_sel)
 * 100:  use the related counter rld_cmp_sel0  to select one compare point
 * 101:  use the related counter rld_cmp_sel1, to select one compare point
 * 11x:  reserved, no update.
 */
#define PWMV2_CMP_CFG_CMP_UPDATE_TIME_MASK (0x7000000UL)
#define PWMV2_CMP_CFG_CMP_UPDATE_TIME_SHIFT (24U)
#define PWMV2_CMP_CFG_CMP_UPDATE_TIME_SET(x) (((uint32_t)(x) << PWMV2_CMP_CFG_CMP_UPDATE_TIME_SHIFT) & PWMV2_CMP_CFG_CMP_UPDATE_TIME_MASK)
#define PWMV2_CMP_CFG_CMP_UPDATE_TIME_GET(x) (((uint32_t)(x) & PWMV2_CMP_CFG_CMP_UPDATE_TIME_MASK) >> PWMV2_CMP_CFG_CMP_UPDATE_TIME_SHIFT)

/*
 * CMP_IN_SEL (RW)
 *
 * 0x00~0x1B select one of the shadow_val directly
 * 0x20~0x2F select one of the calculation cell output
 * 0x30~0x37 select one of capture_pos value(low 8bit are 0)
 * 0x38+k select T/4
 * 0x3E select 0xFFFFF000
 * 0x3F select 0xFFFFFF00
 * others select 0
 */
#define PWMV2_CMP_CFG_CMP_IN_SEL_MASK (0x3F0000UL)
#define PWMV2_CMP_CFG_CMP_IN_SEL_SHIFT (16U)
#define PWMV2_CMP_CFG_CMP_IN_SEL_SET(x) (((uint32_t)(x) << PWMV2_CMP_CFG_CMP_IN_SEL_SHIFT) & PWMV2_CMP_CFG_CMP_IN_SEL_MASK)
#define PWMV2_CMP_CFG_CMP_IN_SEL_GET(x) (((uint32_t)(x) & PWMV2_CMP_CFG_CMP_IN_SEL_MASK) >> PWMV2_CMP_CFG_CMP_IN_SEL_SHIFT)

/*
 * CMP_CNT (RW)
 *
 * select one from 4 counters, only for N>=16.
 * for N<16, this field is0, every 4 compare point related to one counter(0123 for counter0, 4567 for counter1….)
 */
#define PWMV2_CMP_CFG_CMP_CNT_MASK (0xC000U)
#define PWMV2_CMP_CFG_CMP_CNT_SHIFT (14U)
#define PWMV2_CMP_CFG_CMP_CNT_SET(x) (((uint32_t)(x) << PWMV2_CMP_CFG_CMP_CNT_SHIFT) & PWMV2_CMP_CFG_CMP_CNT_MASK)
#define PWMV2_CMP_CFG_CMP_CNT_GET(x) (((uint32_t)(x) & PWMV2_CMP_CFG_CMP_CNT_MASK) >> PWMV2_CMP_CFG_CMP_CNT_SHIFT)



/* SHADOW_VAL register group index macro definition */
#define PWMV2_SHADOW_VAL_0 (0UL)
#define PWMV2_SHADOW_VAL_1 (1UL)
#define PWMV2_SHADOW_VAL_2 (2UL)
#define PWMV2_SHADOW_VAL_3 (3UL)
#define PWMV2_SHADOW_VAL_4 (4UL)
#define PWMV2_SHADOW_VAL_5 (5UL)
#define PWMV2_SHADOW_VAL_6 (6UL)
#define PWMV2_SHADOW_VAL_7 (7UL)
#define PWMV2_SHADOW_VAL_8 (8UL)
#define PWMV2_SHADOW_VAL_9 (9UL)
#define PWMV2_SHADOW_VAL_10 (10UL)
#define PWMV2_SHADOW_VAL_11 (11UL)
#define PWMV2_SHADOW_VAL_12 (12UL)
#define PWMV2_SHADOW_VAL_13 (13UL)
#define PWMV2_SHADOW_VAL_14 (14UL)
#define PWMV2_SHADOW_VAL_15 (15UL)
#define PWMV2_SHADOW_VAL_16 (16UL)
#define PWMV2_SHADOW_VAL_17 (17UL)
#define PWMV2_SHADOW_VAL_18 (18UL)
#define PWMV2_SHADOW_VAL_19 (19UL)
#define PWMV2_SHADOW_VAL_20 (20UL)
#define PWMV2_SHADOW_VAL_21 (21UL)
#define PWMV2_SHADOW_VAL_22 (22UL)
#define PWMV2_SHADOW_VAL_23 (23UL)
#define PWMV2_SHADOW_VAL_24 (24UL)
#define PWMV2_SHADOW_VAL_25 (25UL)
#define PWMV2_SHADOW_VAL_26 (26UL)
#define PWMV2_SHADOW_VAL_27 (27UL)

/* PWM register group index macro definition */
#define PWMV2_PWM_0 (0UL)
#define PWMV2_PWM_1 (1UL)
#define PWMV2_PWM_2 (2UL)
#define PWMV2_PWM_3 (3UL)
#define PWMV2_PWM_4 (4UL)
#define PWMV2_PWM_5 (5UL)
#define PWMV2_PWM_6 (6UL)
#define PWMV2_PWM_7 (7UL)

/* TRIGGER_CFG register group index macro definition */
#define PWMV2_TRIGGER_CFG_0 (0UL)
#define PWMV2_TRIGGER_CFG_1 (1UL)
#define PWMV2_TRIGGER_CFG_2 (2UL)
#define PWMV2_TRIGGER_CFG_3 (3UL)
#define PWMV2_TRIGGER_CFG_4 (4UL)
#define PWMV2_TRIGGER_CFG_5 (5UL)
#define PWMV2_TRIGGER_CFG_6 (6UL)
#define PWMV2_TRIGGER_CFG_7 (7UL)

/* CNT_RELOAD_WORK register group index macro definition */
#define PWMV2_CNT_RELOAD_WORK_0 (0UL)
#define PWMV2_CNT_RELOAD_WORK_1 (1UL)
#define PWMV2_CNT_RELOAD_WORK_2 (2UL)
#define PWMV2_CNT_RELOAD_WORK_3 (3UL)

/* CMP_VAL_WORK register group index macro definition */
#define PWMV2_CMP_VAL_WORK_0 (0UL)
#define PWMV2_CMP_VAL_WORK_1 (1UL)
#define PWMV2_CMP_VAL_WORK_2 (2UL)
#define PWMV2_CMP_VAL_WORK_3 (3UL)
#define PWMV2_CMP_VAL_WORK_4 (4UL)
#define PWMV2_CMP_VAL_WORK_5 (5UL)
#define PWMV2_CMP_VAL_WORK_6 (6UL)
#define PWMV2_CMP_VAL_WORK_7 (7UL)
#define PWMV2_CMP_VAL_WORK_8 (8UL)
#define PWMV2_CMP_VAL_WORK_9 (9UL)
#define PWMV2_CMP_VAL_WORK_10 (10UL)
#define PWMV2_CMP_VAL_WORK_11 (11UL)
#define PWMV2_CMP_VAL_WORK_12 (12UL)
#define PWMV2_CMP_VAL_WORK_13 (13UL)
#define PWMV2_CMP_VAL_WORK_14 (14UL)
#define PWMV2_CMP_VAL_WORK_15 (15UL)
#define PWMV2_CMP_VAL_WORK_16 (16UL)
#define PWMV2_CMP_VAL_WORK_17 (17UL)
#define PWMV2_CMP_VAL_WORK_18 (18UL)
#define PWMV2_CMP_VAL_WORK_19 (19UL)
#define PWMV2_CMP_VAL_WORK_20 (20UL)
#define PWMV2_CMP_VAL_WORK_21 (21UL)
#define PWMV2_CMP_VAL_WORK_22 (22UL)
#define PWMV2_CMP_VAL_WORK_23 (23UL)

/* CNT_VAL register group index macro definition */
#define PWMV2_CNT_VAL_0 (0UL)
#define PWMV2_CNT_VAL_1 (1UL)
#define PWMV2_CNT_VAL_2 (2UL)
#define PWMV2_CNT_VAL_3 (3UL)

/* DAC_VALUE_SV register group index macro definition */
#define PWMV2_DAC_VALUE_SV_0 (0UL)
#define PWMV2_DAC_VALUE_SV_1 (1UL)
#define PWMV2_DAC_VALUE_SV_2 (2UL)
#define PWMV2_DAC_VALUE_SV_3 (3UL)

/* CAPTURE_POS register group index macro definition */
#define PWMV2_CAPTURE_POS_0 (0UL)
#define PWMV2_CAPTURE_POS_1 (1UL)
#define PWMV2_CAPTURE_POS_2 (2UL)
#define PWMV2_CAPTURE_POS_3 (3UL)
#define PWMV2_CAPTURE_POS_4 (4UL)
#define PWMV2_CAPTURE_POS_5 (5UL)
#define PWMV2_CAPTURE_POS_6 (6UL)
#define PWMV2_CAPTURE_POS_7 (7UL)

/* CAPTURE_NEG register group index macro definition */
#define PWMV2_CAPTURE_NEG_0 (0UL)
#define PWMV2_CAPTURE_NEG_1 (1UL)
#define PWMV2_CAPTURE_NEG_2 (2UL)
#define PWMV2_CAPTURE_NEG_3 (3UL)
#define PWMV2_CAPTURE_NEG_4 (4UL)
#define PWMV2_CAPTURE_NEG_5 (5UL)
#define PWMV2_CAPTURE_NEG_6 (6UL)
#define PWMV2_CAPTURE_NEG_7 (7UL)

/* CNT register group index macro definition */
#define PWMV2_CNT_0 (0UL)
#define PWMV2_CNT_1 (1UL)
#define PWMV2_CNT_2 (2UL)
#define PWMV2_CNT_3 (3UL)

/* CAL register group index macro definition */
#define PWMV2_CAL_0 (0UL)
#define PWMV2_CAL_1 (1UL)
#define PWMV2_CAL_2 (2UL)
#define PWMV2_CAL_3 (3UL)
#define PWMV2_CAL_4 (4UL)
#define PWMV2_CAL_5 (5UL)
#define PWMV2_CAL_6 (6UL)
#define PWMV2_CAL_7 (7UL)
#define PWMV2_CAL_8 (8UL)
#define PWMV2_CAL_9 (9UL)
#define PWMV2_CAL_10 (10UL)
#define PWMV2_CAL_11 (11UL)
#define PWMV2_CAL_12 (12UL)
#define PWMV2_CAL_13 (13UL)
#define PWMV2_CAL_14 (14UL)
#define PWMV2_CAL_15 (15UL)

/* CMP register group index macro definition */
#define PWMV2_CMP_0 (0UL)
#define PWMV2_CMP_1 (1UL)
#define PWMV2_CMP_2 (2UL)
#define PWMV2_CMP_3 (3UL)
#define PWMV2_CMP_4 (4UL)
#define PWMV2_CMP_5 (5UL)
#define PWMV2_CMP_6 (6UL)
#define PWMV2_CMP_7 (7UL)
#define PWMV2_CMP_8 (8UL)
#define PWMV2_CMP_9 (9UL)
#define PWMV2_CMP_10 (10UL)
#define PWMV2_CMP_11 (11UL)
#define PWMV2_CMP_12 (12UL)
#define PWMV2_CMP_13 (13UL)
#define PWMV2_CMP_14 (14UL)
#define PWMV2_CMP_15 (15UL)
#define PWMV2_CMP_16 (16UL)
#define PWMV2_CMP_17 (17UL)
#define PWMV2_CMP_18 (18UL)
#define PWMV2_CMP_19 (19UL)
#define PWMV2_CMP_20 (20UL)
#define PWMV2_CMP_21 (21UL)
#define PWMV2_CMP_22 (22UL)
#define PWMV2_CMP_23 (23UL)


#endif /* HPM_PWMV2_H */
